sprayOF/C12_Case/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// ************************************************************************* //

dimensions          [1 -1 -2 0 0 0 0];

internalField       uniform 65e+05;

boundaryField
{
    liner
    {
        type            zeroGradient;
    }
    cylinderHead
    {
        type            zeroGradient;
    }
    piston
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
