sprayOF/C12_Case/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 500;

boundaryField
{
    liner
    {
        type            zeroGradient;//epsilonWallFunction;
        //value           uniform 1000;
    }
    cylinderHead
    {
        type            zeroGradient;
        //type            epsilonWallFunction;
        //value           uniform 1000;
    }
    piston
    {
        type            zeroGradient;
        //type            epsilonWallFunction;
        //value           uniform 1000;
    }
}


// ************************************************************************* //
