sprayOF/C12_Case/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.8;

boundaryField
{
    liner
    {
        type            kqRWallFunction;
        value           uniform 0.8;
    }
    cylinderHead
    {
        //type            zeroGradient
	type		kqRWallFunction;
	value		uniform 0.8;
    }
    piston
    {
        type            kqRWallFunction;
        value           uniform 0.8;
    }
}


// ************************************************************************* //
