sprayOF/C12_Case/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    rho
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0.1;
    }

    rhoFinal
    {
        $rho;
        tolerance       1e-06;
        relTol          0;
    }

    "(U|k|epsilon)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-06;
        relTol          0.1;
    }

    p
    {
        solver          GAMG;
        tolerance       0;
        relTol          0.1;
        smoother        GaussSeidel;
    }

    pFinal
    {
        $p;
        tolerance       1e-06;
        relTol          0;
    }

    "(U|k|epsilon)Final"
    {
        $U;
        tolerance       1e-06;
        relTol          0;
    }

    "(Yi|N2)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-06;
        relTol          0;
    }

    h
    {
        $Yi;
        relTol          0.1;
    }

    hFinal
    {
        $Yi;
    }
}

PIMPLE
{
    /*transonic       yes;
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
    momentumPredictor yes;*/
    transonic       yes;
    consistent      yes;
    nOuterCorrectors    1;
    nCorrectors     1;
    nNonOrthogonalCorrectors 1;
    //momentumPredictor yes;
}

relaxationFactors
{
    equations
    {
        ".*Final"       1.0;
    }
}

// ************************************************************************* //
