sprayOF/C12_Case/Allrun
cd ${0%/*} || exit 1   #run from this direactory

mkdir 0

blockMesh

rm -rf 0
cp -rf 0.org 0

sprayFoam > log

